{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of57.bin", "group1-shard2of57.bin", "group1-shard3of57.bin", "group1-shard4of57.bin", "group1-shard5of57.bin", "group1-shard6of57.bin", "group1-shard7of57.bin", "group1-shard8of57.bin", "group1-shard9of57.bin", "group1-shard10of57.bin", "group1-shard11of57.bin", "group1-shard12of57.bin", "group1-shard13of57.bin", "group1-shard14of57.bin", "group1-shard15of57.bin", "group1-shard16of57.bin", "group1-shard17of57.bin", "group1-shard18of57.bin", "group1-shard19of57.bin", "group1-shard20of57.bin", "group1-shard21of57.bin", "group1-shard22of57.bin", "group1-shard23of57.bin", "group1-shard24of57.bin", "group1-shard25of57.bin", "group1-shard26of57.bin", "group1-shard27of57.bin", "group1-shard28of57.bin", "group1-shard29of57.bin", "group1-shard30of57.bin", "group1-shard31of57.bin", "group1-shard32of57.bin", "group1-shard33of57.bin", "group1-shard34of57.bin", "group1-shard35of57.bin", "group1-shard36of57.bin", "group1-shard37of57.bin", "group1-shard38of57.bin", "group1-shard39of57.bin", "group1-shard40of57.bin", "group1-shard41of57.bin", "group1-shard42of57.bin", "group1-shard43of57.bin", "group1-shard44of57.bin", "group1-shard45of57.bin", "group1-shard46of57.bin", "group1-shard47of57.bin", "group1-shard48of57.bin", "group1-shard49of57.bin", "group1-shard50of57.bin", "group1-shard51of57.bin", "group1-shard52of57.bin", "group1-shard53of57.bin", "group1-shard54of57.bin", "group1-shard55of57.bin", "group1-shard56of57.bin", "group1-shard57of57.bin"], "weights": [{"name": "conv1_conv/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv1_conv/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_preact_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_preact_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_preact_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_preact_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_1_conv/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "conv2_block1_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_2_conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2_block1_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block1_0_conv/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_block1_0_conv/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2_block1_3_conv/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_block1_3_conv/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2_block2_preact_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv2_block2_preact_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2_block2_preact_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv2_block2_preact_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2_block2_1_conv/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "conv2_block2_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_2_conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2_block2_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block2_3_conv/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_block2_3_conv/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2_block3_preact_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv2_block3_preact_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv2_block3_preact_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv2_block3_preact_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2_block3_1_conv/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "conv2_block3_1_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_1_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_1_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_1_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_2_conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2_block3_2_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_2_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_2_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_2_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2_block3_3_conv/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2_block3_3_conv/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_block1_preact_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv3_block1_preact_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv3_block1_preact_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv3_block1_preact_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv3_block1_1_conv/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv3_block1_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block1_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block1_0_conv/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "conv3_block1_0_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block1_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block1_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block2_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block2_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block2_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block2_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block2_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block2_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block2_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block2_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block2_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block3_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block3_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block3_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block3_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block3_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block3_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block3_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block3_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block3_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block4_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block4_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block4_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block4_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block4_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block4_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block4_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block4_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block4_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block5_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block5_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block5_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block5_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block5_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block5_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block5_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block5_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block5_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block6_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block6_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block6_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block6_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block6_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block6_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block6_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block6_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block6_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block7_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block7_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block7_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block7_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block7_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block7_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block7_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block7_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block7_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv3_block8_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv3_block8_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv3_block8_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv3_block8_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv3_block8_1_conv/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "conv3_block8_1_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_1_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_1_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_1_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_2_conv/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv3_block8_2_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_2_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_2_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_2_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv3_block8_3_conv/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "conv3_block8_3_conv/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_block1_preact_bn/gamma", "shape": [512], "dtype": "float32"}, {"name": "conv4_block1_preact_bn/beta", "shape": [512], "dtype": "float32"}, {"name": "conv4_block1_preact_bn/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "conv4_block1_preact_bn/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv4_block1_1_conv/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv4_block1_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block1_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block1_0_conv/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "conv4_block1_0_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block1_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block1_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block2_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block2_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block2_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block2_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block2_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block2_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block2_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block2_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block2_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block3_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block3_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block3_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block3_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block3_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block3_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block3_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block3_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block3_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block4_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block4_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block4_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block4_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block4_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block4_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block4_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block4_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block4_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block5_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block5_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block5_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block5_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block5_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block5_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block5_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block5_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block5_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block6_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block6_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block6_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block6_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block6_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block6_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block6_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block6_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block6_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block7_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block7_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block7_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block7_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block7_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block7_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block7_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block7_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block7_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block8_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block8_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block8_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block8_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block8_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block8_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block8_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block8_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block8_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block9_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block9_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block9_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block9_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block9_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block9_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block9_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block9_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block9_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block10_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block10_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block10_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block10_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block10_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block10_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block10_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block10_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block10_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block11_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block11_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block11_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block11_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block11_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block11_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block11_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block11_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block11_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block12_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block12_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block12_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block12_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block12_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block12_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block12_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block12_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block12_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block13_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block13_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block13_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block13_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block13_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block13_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block13_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block13_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block13_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block14_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block14_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block14_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block14_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block14_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block14_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block14_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block14_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block14_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block15_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block15_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block15_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block15_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block15_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block15_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block15_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block15_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block15_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block16_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block16_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block16_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block16_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block16_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block16_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block16_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block16_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block16_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block17_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block17_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block17_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block17_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block17_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block17_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block17_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block17_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block17_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block18_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block18_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block18_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block18_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block18_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block18_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block18_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block18_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block18_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block19_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block19_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block19_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block19_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block19_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block19_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block19_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block19_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block19_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block20_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block20_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block20_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block20_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block20_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block20_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block20_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block20_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block20_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block21_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block21_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block21_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block21_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block21_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block21_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block21_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block21_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block21_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block22_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block22_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block22_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block22_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block22_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block22_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block22_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block22_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block22_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block23_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block23_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block23_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block23_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block23_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block23_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block23_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block23_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block23_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block24_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block24_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block24_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block24_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block24_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block24_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block24_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block24_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block24_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block25_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block25_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block25_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block25_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block25_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block25_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block25_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block25_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block25_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block26_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block26_preact_bn/beta", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block26_preact_bn/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block26_preact_bn/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block26_1_conv/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "conv4_block26_1_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_1_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_1_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_1_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_2_conv/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv4_block26_2_bn/gamma", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_2_bn/beta", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_2_bn/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_2_bn/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv4_block26_3_conv/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "conv4_block26_3_conv/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv4_block27_preact_bn/gamma", "shape": [1024], "dtype": "float32"}, {"name": 